<a href="https://colab.research.google.com/github/TheusZer0/TheusZero/blob/gh-pages/Copia_de_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL
## Introducción

Durante esta actividad vamos a aprender los conceptos básicos de SQL. Vamos a aprender a insertar, eliminar y actualizar datos de una base de datos además de hacer consultas sencillas sobre ellos.


### Requisitos

Para esta actividad, así como en las siguientes actividades de SQL vamos a utilizar
- Python 3
- Jupyter
- La librería ipython-sql. Para instalarla pueden hacerlo con pip3:
```
pip3 install ipython-sql
```
- SQLite3, que viene junto con la instalación de Python

### Outline
En esta actividad aprendermos a:
- Crear y modificar tablas.
- Insertar, eliminar y actualizar datos.
- Crear llaves en las tablas.
- Hacer consultas que involucren selección, proyección, producto cruz y operaciones de conjuntos.
- Consultas básicas de agregación.

### Esquema
Para esta actividad vamos a trabajar con el siguiente esquema:
- Magos(mid INT PRIMARY KEY, mnombre VARCHAR(100), medad INT)
- Asignaturas(aid INT PRIMARY KEY, anombre VARCHAR(100), acreditos VARCHAR(100))
- Cursos(mid INT, aid INT, fecha DATE, PRIMARY KEY(mid, aid))
Que corresponde a magos que toman asignaturas en un curso de un año. El mid y aid en la tabla Curso proviene de las tablas Magos y Asignaturas respectivamente.

## Actividad

### Crear tablas, eliminar tablas y llaves primarias

En esta actividad vamos a utilizar `ipython-sql` para tener acceso a SQL desde este _notebook_. Lo vamos a importar a continuación.

In [ ]:
import os
import inspect
inspect.getfile(os)

'/usr/lib/python3.6/os.py'

In [ ]:
pip install ipython-sql

Requirement already satisfied: ipython-sql in /usr/local/lib/python3.6/dist-packages (0.3.9)
Requirement already satisfied: sqlalchemy>=0.6.7 in /usr/local/lib/python3.6/dist-packages (from ipython-sql) (1.3.20)
Requirement already satisfied: prettytable in /usr/local/lib/python3.6/dist-packages (from ipython-sql) (1.0.1)
Requirement already satisfied: sqlparse in /usr/local/lib/python3.6/dist-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.6/dist-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: six in /usr/local/lib/python3.6/dist-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython>=1.0 in /usr/local/lib/python3.6/dist-packages (from ipython-sql) (5.5.0)
Requirement already satisfied: setuptools in /usr/local/lib/python3.6/dist-packages (from prettytable->ipython-sql) (50.3.2)
Requirement already satisfied: wcwidth in /usr/local/lib/python3.6/dist-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: pygments in /usr/local/lib/python3.6/dist-packages (from ipython>=1.0->ipython-sql) (2.6.1)
Requirement already satisfied: prompt-toolkit<2.0.0,>=1.0.4 in /usr/local/lib/python3.6/dist-packages (from ipython>=1.0->ipython-sql) (1.0.18)
Requirement already satisfied: decorator in /usr/local/lib/python3.6/dist-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: simplegeneric>0.8 in /usr/local/lib/python3.6/dist-packages (from ipython>=1.0->ipython-sql) (0.8.1)
Requirement already satisfied: pickleshare in /usr/local/lib/python3.6/dist-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: pexpect; sys_platform != "win32" in /usr/local/lib/python3.6/dist-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.6/dist-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.6/dist-packages (from pexpect; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)

In [ ]:
%load_ext sql

Ahora vamos a crear una nueva base de datos para esta actividad. Esta base de datos se llamará `hogwarts.db`.

In [ ]:
%sql sqlite:///hogwarts.db

'Connected: @hogwarts.db'

**Ojo**: cada vez que anteponemos `%sql` es porque esa línea corresponde a un comando a SQL que va a la base de datos en la que estamos trabajando (en este caso `hogwarts.db`). Si queremos tener todo un bloque con instrucciones SQL tenemos que usar `%%sql` (habrán ejemplos de esto a lo largo del _notebook_).

Tu primera prueba será crear una base de datos de acuerdo el esquema de arriba. La sintaxis para crear tablas en SQL es la siguiente (si están trabajando desde el cliente, después de cada sentencia SQL debes poner un punto y coma `;`):

```SQL
CREATE TABLE <Nombre Tabla> (<atributo_1> tipo, ... , <attributo_N> tipo)
```

Por ejemplo, para crear la tabla de Magos:

In [ ]:
%%sql 
DROP TABLE IF EXISTS Magos;
CREATE TABLE Magos(mid INT, mnombre VARCHAR(100), mhechizos INT, medad INT);

 * sqlite:///hogwarts.db
Done.
Done.

[]

En la celda anterior estamos eliminando la tabla si es que existe para luego crear una tabla según lo requerido por el esquema. Pero cuidado! Olvidamos agregar la llave primaria, por lo que vamos a **eliminar** la tabla y crearla de nuevo. Además, vamos a agregar un valor por defecto al atributo `mhechizos`, que en este caso será 0.

In [ ]:
%%sql 
DROP TABLE Magos;
CREATE TABLE Magos(mid INT PRIMARY KEY, mnombre VARCHAR(100), mhechizos FLOAT DEFAULT 0, medad INT);

 * sqlite:///hogwarts.db
Done.
Done.

[]

Otra opción es agregar la llave primaria al final de la instrucción `CREATE TABLE`. Para ver un ejemplo, vamos a crear la tabla de cursos.

In [ ]:
%%sql 
DROP TABLE IF EXISTS Cursos;
CREATE TABLE Cursos(mid INT, aid INT, fecha DATE, PRIMARY KEY(mid, aid));

 * sqlite:///hogwarts.db
Done.
Done.

[]

En el caso anterior, tenemos una llave primaria compuesta. En general, para crear una tabla con llave primaria, lo señalamos al final, de la forma:

```SQL
CREATE TABLE <Nombre Tabla> (
    <atributo_1> tipo, ..., 
    <attributo_N> tipo, 
    PRIMARY KEY(<atributos separados por coma (,)>))
```

**1.** Ahora es tu turno. En la celda a continuación debes crear la tabla de Asignaturas. No olvides agregar su llave primaria.

In [ ]:
%%sql 
DROP TABLE IF EXISTS Asignatura;
CREATE TABLE Asignatura(mid INT, aid INT, fecha DATE, PRIMARY KEY(mid, aid));

 * sqlite:///hogwarts.db
Done.
Done.

[]

### Tipos de datos

Al crear las tablas disponemos varios tipos de datos. Por ahora destacamos los siguientes:

- Caracteres (_Strings_):
  - `CHAR(20)`: _Strings_ de largo fijo.
  - `VARCHAR(20)`: _Strings_ de largo variable.
  
- Números:
  - `INT`
  - `FLOAT`
  - `SMALLINT`
  
- Tiempos y fechas:
  - `DATE`: fecha.
  - `TIME`: hora.
  - `TIMESTAMP`: fecha y hora.

### Insertar, eliminar y modificar elementos en tablas

Si ejecutamos la consulta `SELECT * FROM Magos` notaremos que el resultado es vacío. Esto es evidente, ya que esta consulta me retorna todo lo que tengo en la tabla `Magos` y actualmente no hemos insertado nada.

In [ ]:
%sql SELECT * FROM Magos;

 * sqlite:///hogwarts.db
Done.

[]

Para insertar valores, la forma básica es la siguiente:

```SQL
INSERT INTO <Nombre Tabla> 
VALUES (<valor atributo 1> , ..., <valor atributo N>)
```

Por ejemplo si ejecutamos la consulta:

```SQL
INSERT INTO Magos 
VALUES(1, 'Harry', 0, 15)
```

estamos insertando un Mago con `mid` 1, `mnombre` Harry, `mhechizos` 5 y `medad` 15.

In [ ]:
%sql INSERT INTO Magos VALUES(null, 'Harry', 5, 15)

 * sqlite:///hogwarts.db
1 rows affected.

[]

Recordemos que habíamos señalado que la llave primaria de la tabla `Magos` era el `mid`. Veamos que pasa si intentamos insertar un mago con el mismo `mid`.

In [ ]:
%sql INSERT INTO Magos VALUES(null, 'Voldemort', 100, 35)

 * sqlite:///hogwarts.db
1 rows affected.

[]

La consulta anterior debería haber arrojado un error. Así que vamos a cambiar el `mid`. Sin embargo, vamos a omitir algunos atributos.

In [ ]:
%sql INSERT INTO Magos(mid, mnombre) VALUES(13, 'Voldemort')

 * sqlite:///hogwarts.db
1 rows affected.

[]

In [ ]:
%sql SELECT * FROM Magos

 * sqlite:///hogwarts.db
Done.

[(None, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (1, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (None, 'Voldemort', 100.0, 35),
 (13, 'Voldemort', 0.0, None)]

Si te das cuenta, ahora tenemos dos tuplas en la tabla de magos. Como podrías haber esperado, dado que omitimos el valor para ciertos atributos en la segunda inserción, el `mhechizos` tomó el valor _default_. Pero ojo! el atributo `medad` tomó un valor **nulo**. Más adelante en el curso vamos a ahondar en esta temática y ver por qué los valores nulos pueden ser un problema. Ahora vamos a agregar una nueva tupla para hacer algunas consultas sencillas.

In [ ]:
%sql INSERT INTO Magos VALUES(24, 'Ron', 8, 15);

 * sqlite:///hogwarts.db
1 rows affected.

[]

In [ ]:
%sql SELECT * FROM Magos;

 * sqlite:///hogwarts.db
Done.

[(None, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (1, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (None, 'Voldemort', 100.0, 35),
 (13, 'Voldemort', 0.0, None),
 (23, 'Ron', 8.0, 15)]

In [ ]:
%sql SELECT * FROM Magos WHERE mnombre='Ron';

 * sqlite:///hogwarts.db
Done.

[(23, 'Ron', 8.0, 15), (24, 'Ron', 8.0, 15)]

En la consulta anterior estamos filtrando por Magos donde su nombre sea `'Ron'`. Si queremos que el nombre **contenga** `'Ron'` usamos la instrucción `LIKE`:

In [ ]:
%sql SELECT * FROM Magos WHERE mnombre LIKE '%Ron%'

 * sqlite:///hogwarts.db
Done.

[(23, 'Ron', 8.0, 15), (24, 'Ron', 8.0, 15)]

Pueden notar que hemos añadido un `%` al _string_. Esto es porque antes y después de `Ron` queremos permitir cualquier secuencia de caracteres. Para el `LIKE` tenemos dos instrucciones posibles:

- `%` que significa cualquier secuencia de caracteres.
- `_` que significa un caracter, pero **solamente** uno.

Como no estamos seguros de mantener a `Ron` en la tabla `Magos` lo vamos a eliminar. Para eliminar tuplas lo hacemos con la instrucción `DELETE`. Veamos que pasa al ejecutar la siguiente consulta:

In [ ]:
%sql DELETE FROM Magos WHERE mid=None

 * sqlite:///hogwarts.db
(sqlite3.OperationalError) no such column: None
[SQL: DELETE FROM Magos WHERE mid=None]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [ ]:
%sql SELECT * FROM Magos

 * sqlite:///hogwarts.db
Done.

[]

Lo que hicimos fue borrar de la tabla `Magos` todas las tuplas que satisfacen la condición en el `WHERE` de la consulta. Para actualizar una tupla usamos la instrucción `UPDATE`, como veremos a continuación:

In [ ]:
%sql UPDATE Magos SET mnombre='The one who must no be named', mhechizos = 2000 WHERE mid=13

 * sqlite:///hogwarts.db
1 rows affected.

[]

In [ ]:
%sql SELECT * FROM Magos

 * sqlite:///hogwarts.db
Done.

[(None, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (None, 'Voldemort', 100.0, 35),
 (13, 'The one who must no be named', 2000.0, None)]

### Modificando tablas

En SQL es posible modificar tablas. Por ejemplo si quisieramos eliminar el atributo `mhechizo` podríamos ejecutar la consulta:

```SQL
ALTER TABLE Magos DROP COLUMN mhechizo
```

O agregar una columna, como por ejemplo:

```SQL
ALTER TABLE Magos ADD COLUMN rut VARCHAR(20)
```

### Consultas básicas en SQL

Para comenzar a hacer consultas primero debemos llenar nuestras tablas. Asegurate que las instancias de las tablas sean las siguientes:

#### Magos

| mid | mnombre     | mhechizos | medad |
|-----|-------------|---------- |-------|
| 23  | Dumbledore  | 100       | 99    |
| 29  | Ron         | 1         | 15    |
| 31  | Harry       | 8         | 15    |
| 32  | Carlos      | 40        | 40    |
| 58  | Hermione    | 15        | 15    |
| 64  | Minerva     | 50        | 65    |
| 71  | Pedro       | 10        | 16    |
| 74  | Severus     | 55        | 55    |
| 85  | Remus       | 60        | 45    |
| 95  | Felipe      | 5         | 63    |

#### Asignaturas

| aid | anombre             | acreditos |
|-----|---------------------|-----------|
| 101 | Hechizos            | 3         |
| 102 | Artes oscuras       | 4         |
| 103 | Plantas             | 2         |
| 104 | Encantamientos      | 4         |

#### Cursos

| mid | aid | fecha    |
|-----|-----|----------|
| 23  | 101 | 10/10/16 |
| 23  | 102 | 10/10/16 |
| 23  | 103 | 8/10/16  |
| 23  | 104 | 7/10/17  |
| 31  | 102 | 10/11/17 |
| 31  | 103 | 6/11/18  |
| 31  | 104 | 12/11/18 |
| 64  | 101 | 5/9/18   |
| 64  | 102 | 8/9/18   |
| 74  | 103 | 8/9/18   |

**Hint**: Para insertar un tipo fecha en SQLITE tienes que ingresarlo entre comillas simples en el formato `'YYYY-MM-DD'`, por ejemplo:

In [ ]:
%sql INSERT INTO Cursos VALUES(1, 101, '2018-10-10')

 * sqlite:///hogwarts.db
1 rows affected.

[]

In [ ]:
%%sql 
INSERT INTO Magos VALUES(10, 'Dumbledore', 100, 99);
INSERT INTO Magos VALUES(29, 'Ron'       , 1  , 15);
INSERT INTO Magos VALUES(31, 'Harry'     , 8  , 15);
INSERT INTO Magos VALUES(32, 'Carlos'    , 40 , 40);
INSERT INTO Magos VALUES(58, 'Hermione'  , 15 , 15);
INSERT INTO Magos VALUES(64, 'Minerva'   , 50 , 65);
INSERT INTO Magos VALUES(71, 'Pedro'     , 10 , 16);
INSERT INTO Magos VALUES(74, 'Severus'   , 55 , 55);
INSERT INTO Magos VALUES(85, 'Remus'     , 60 , 45);
INSERT INTO Magos VALUES(95, 'Felipe'    , 5  , 63);

 * sqlite:///hogwarts.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Asignatura VALUES(101, 'Hechizos', 3);
INSERT INTO Asignatura VALUES(102, 'Artes oscuras', 4);
INSERT INTO Asignatura VALUES(103, 'Plantas', 2);
INSERT INTO Asignatura VALUES(104, 'Encantamientos', 4);

 * sqlite:///hogwarts.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
%%sql 
INSERT INTO Cursos VALUES (23 , 101, '10-10-16');
INSERT INTO Cursos VALUES (23 , 102, '10-10-16');
INSERT INTO Cursos VALUES (23 , 103, '8-10-16');
INSERT INTO Cursos VALUES (23 , 104, '7-10-17');
INSERT INTO Cursos VALUES (31 , 102, '10-11-17');
INSERT INTO Cursos VALUES (31 , 103, '6-11-18');
INSERT INTO Cursos VALUES (31 , 104, '12-11-18');
INSERT INTO Cursos VALUES (64 , 101, '5-9-18');
INSERT INTO Cursos VALUES (64 , 102, '8-9-18');
INSERT INTO Cursos VALUES (74 , 103, '8-9-18');

 * sqlite:///hogwarts.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Las consultas más básicas son de la forma `SELECT - FROM - WHERE`. En general, la consulta de álgebra relacional:

$$
\pi_{a_1, \dots, a_n}(\sigma_{\text{condiciones}}(R_1 \times R_m))
$$

se traduce en SQL como:

```SQL
SELECT a_1, ..., a_n
FROM R_1, ..., R_m
WHERE <condiciones>
```

**2.** Prueba la siguiente consulta:

In [25]:
%sql SELECT mid, mnombre, mhechizos, medad FROM Magos

 * sqlite:///hogwarts.db
Done.

[(10, 'Dumbledore', 100.0, 99),
 (29, 'Ron', 1.0, 15),
 (31, 'Harry', 8.0, 15),
 (32, 'Carlos', 40.0, 40),
 (58, 'Hermione', 15.0, 15),
 (64, 'Minerva', 50.0, 65),
 (71, 'Pedro', 10.0, 16),
 (74, 'Severus', 55.0, 55),
 (85, 'Remus', 60.0, 45),
 (95, 'Felipe', 5.0, 63)]

¿Qué es lo que debería hacer la consulta anterior? Recuerda que si lo que quieres es proyectar todos los atributos puedes usar `*`.

**3.** Ahora realiza dos consultas, una para obtener todo desde la tabla `Cursos` y todo de la tabla `Asignaturas`. Revisa que agregaste todos los datos correctamente.

In [ ]:
# Curso
%sql SELECT * from Cursos;

 * sqlite:///hogwarts.db
Done.

[(1, 101, '2018-10-10'),
 (23, 101, '10-10-16'),
 (23, 102, '10-10-16'),
 (23, 103, '8-10-16'),
 (23, 104, '7-10-17'),
 (31, 102, '10-11-17'),
 (31, 103, '6-11-18'),
 (31, 104, '12-11-18'),
 (64, 101, '5-9-18'),
 (64, 102, '8-9-18'),
 (74, 103, '8-9-18')]

In [ ]:
# Asignatura
%sql SELECT * FROM Asignatura

 * sqlite:///hogwarts.db
Done.

[(101, 'Hechizos', 3),
 (102, 'Artes oscuras', 4),
 (103, 'Plantas', 2),
 (104, 'Encantamientos', 4)]

Ahora ejecuta la consulta a continuación. ¿Qué crees que retorna?

In [ ]:
%sql SELECT * FROM Magos WHERE mnombre='Juan'

 * sqlite:///hogwarts.db
Done.

[]

Ahora es tu turno, realiza las siguientes consultas en SQL:

**3.2.** Busca los nombres de los magos con más de 4 hechizos aprendidos (prueba seleccionando `*` y luego solo el atributo `mnombre`).

**Ayuda**: Puedes usar los filtros `x = y`, `x < y`, `x <= y`, `<>` (distinto), etc. Para los números es obvio, para los strings es orden lexicográfico.

In [ ]:
%sql SELECT * FROM Magos WHERE mhechizos > 4

 * sqlite:///hogwarts.db
Done.

[]

**4.** Similarmente, busca los nombres de los magos con más de hechizos aprendidos 4 y cuya edad está entre 15 y 40 años.

**Ayuda**: Combina condiciones en el `WHERE` usando `AND` y `OR`. Recuerda que para negar algo puedes usar `NOT`.

In [ ]:
%sql SELECT * FROM Magos WHERE mhechizos > 4 AND medad > 14 AND medad < 41

 * sqlite:///hogwarts.db
Done.

[(1, 'Harry', 5.0, 15),
 (None, 'Harry', 5.0, 15),
 (None, 'Voldemort', 100.0, 35),
 (31, 'Harry', 8.0, 15),
 (32, 'Carlos', 40.0, 40),
 (58, 'Hermione', 15.0, 15),
 (71, 'Pedro', 10.0, 16)]

**5.** Busca la edad de los magos que no tienen una `'a'` en su nombre (recuerda usar `LIKE`).

In [ ]:
%sql SELECT mnombre, medad FROM Magos WHERE mnombre NOT LIKE '%a%'

 * sqlite:///hogwarts.db
Done.

[('Dumbledore', 99),
 ('Ron', 15),
 ('Hermione', 15),
 ('Pedro', 16),
 ('Severus', 55),
 ('Remus', 45),
 ('Felipe', 63)]

Escribe una consulta que entregue los nombres y hechizos de los magos, pero ordenado por `mhechizos`. Para ordenar agrega un `ORDER BY (<atr_1>, ..., <atr_N>) DESC` al final de tu consulta. Eso ordena los resultados por el atributo `<atr_1>`, después `<atr_2>`, etc. Prueba que pasa al eliminar el `DESC` al final del `ORDER BY`.

### Consultas de _join_, unión, intersección y diferencia

Imaginemos que queremos encontrar los nombres de los magos que tomaron la asignatura 103. 

**6.** Escribe primero esta consulta en Álgebra relacional.

Una forma directa para traspasarlo a SQL es con el comando `INNER JOIN`:

In [28]:
%%sql
SELECT mnombre
FROM Magos INNER JOIN Cursos
ON Magos.mid = Cursos.mid
WHERE Cursos.mid = 102

 * sqlite:///hogwarts.db
Done.

[]

Este es un buen minuto para repasar los joins. Puedes correr la consulta de arriba sin el `WHERE` para ver lo que sería el resultado de $\text{Magos} \bowtie_{\text{mid}=\text{mid}} \text{Cursos}$. ¿Qué pasa al agregar la condición del `WHERE`?
Si bien existe la instrucción `INNER JOIN`, una forma más clara (o que a nosotros nos gusta más) es explotando el producto cartesiano:

In [ ]:
%%sql
SELECT mnombre
FROM Magos, Asignaturas
ON Magos.mid = Asignaturas.mid
WHERE Asignaturas.mid = 102

 * sqlite:///hogwarts.db
(sqlite3.OperationalError) no such table: Asignaturas
[SQL: SELECT mnombre
FROM Magos, Asignaturas
ON Magos.mid = Asignaturas.mid
WHERE Asignaturas.mid = 102]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [ ]:
%%sql

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?

En este caso estamos aplicando el `WHERE` al Producto Cartesiano, y por eso incluimos la condición `WHERE Magos.mid = Cursos.mid`. ¿Entiendes por qué ambas consultas son equivalentes?

Ahora intenta escribir las siguientes consultas:

**7.** Los nombres de los magos que asistieron a un curso de plantas.

In [ ]:
%%sql SELECT  *
FROM  Magos as m, Cursos as c
WHERE m.mid = c.mid
AND c.aid = 103

 * sqlite:///hogwarts.db
Done.

[(31, 'Harry', 8.0, 15, 31, 103, '6-11-18'),
 (74, 'Severus', 55.0, 55, 74, 103, '8-9-18')]

**8.** Los nombres de los magos que asistieron a un curso de plantas o encantamientos.

In [ ]:
%sql

**9.** La misma anterior, pero usando `UNION` para unir el resultado de dos consultas. Prueba usando `UNION` y luego `UNION ALL`. ¿Cuál es la diferencia?

In [ ]:
%sql

**10.** Usa `AS` para cambiar de nombres a los atributos (esto es útil no solo para la unión!). La siguiente consulta entrega todos los ids del sistema:

In [ ]:
%%sql
SELECT mid AS id
FROM  Magos
UNION
SELECT mid AS id
FROM Cursos

**11.** Los nombres de los magos que tomaron un curso de plantas y otro de encantamientos. Puedes usar `INTERSECT` para intersectar el resultado de dos consultas. ¿Puedes escribir también esta consulta usando AND?

In [ ]:
%sql

### Sub-consultas y consultas anidadas

Has observado que cada consulta entrega una tabla, los atributos de esa tabla son lo que pones en el `SELECT`. Esto significa que podemos poner cualquier consulta SQL en el `FROM`. Vamos a ver cómo realizar esto.

**12.** Escribe una consulta que entregue los nombres de los magos junto a los mid de los cursos que han tomado, pero contando solo las asignaturas hechas después del primero de octubre del 2017.

In [ ]:
%sql

 * sqlite:///hogwarts.db

'Connected: @hogwarts.db'

Sea $Q$ la consulta anterior. ¿Qué va a retornar la siguiente consulta? (Ojo, tienes que reemplazar el valor de $Q$ en la celda siguiente)

In [ ]:
%%sql
SELECT Cursos.mid, mnombre, 
FROM Cursos, (Q) AS XX
WHERE Cursos.mid = XX.mid

**Importante**: cada vez que quieras anidar una consulta en el `FROM`, debes darle un alias. En el caso anterior el alias es XX.

**13.** Ahora modifica $Q$ para que solo retorne los cid de los cursos, y no los nombres de los magos. ¿Qué retorna la consulta a continuación? ¿Qué pasa si Q entrega dos atributos en vez de uno (es decir, usando $Q$ sin modificar)? ¿Por qué pasa esto?

In [ ]:
%%sql
SELECT Cursos.aid, acreditos
FROM Cursos
WHERE Cursos.aid IN Q

 * sqlite:///hogwarts.db
(sqlite3.OperationalError) no such table: Q
[SQL: SELECT Cursos.aid, acreditos
FROM Cursos
WHERE Cursos.aid IN Q]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

También podemos usar consultas anidadas en el `WHERE`. Además del `IN` podemos usar `NOT IN`, o `> ANY`, `> ALL` para cualquier comparación entre `<`, `>`, `<=`, `>=`, `=`, y también anteponiendo `NOT`.

**Ojo**: `ANY` y `All` no funcionan en SQLite, pero es muy común en los otros sistemas.

Por ejemplo, si queremos encontrar los magos que no han cursado una asignatura de 3 créditos:

1. Primero escribe una consulta que entregue los `mid` de los magos que han cursado una asignatura con un atributo específico.
2. Sea $Q$ la consulta anterior. Los capitanes que no han cursado una asignatura se pueden extraer remplazando $Q$ en:

In [ ]:
%%sql
SELECT mnombre
FROM Magos
WHERE mid NOT IN (Q)

Ahora:

**14.** Encuentre los nombres de los magos que tienen más de 20 años y que no han tomado una asignatura concreta. ¿Puedes escribir esto sin usar consultas anidadas?

In [ ]:
%%sql

**15.** Encuentre los nombres de los magos que tomaron al menos dos cursos.

In [ ]:
%%sql

**16.** Encuentre los nombres de los magos que han tomado todos los cursos. ¿Puedes escribir esto sin usar consultas anidadas?

In [ ]:
%sql

### Agregación

¿Qué pasa si queremos el mago con com más hechizos? Primero, podemos obtener la cantidad de hechizos con la siguiente consulta:

In [ ]:
%%sql
SELECT MAX(mhechizos)
FROM Magos

Luego seleccionamos los nombres de aquellos magos con esos hechizos:

In [ ]:
%%sql
SELECT mnombre
FROM Magos
WHERE mhechizos = (SELECT MAX(mhechizos)
                FROM Magos)

En general SQL soporta varias funciones de agregación: `MAX`, `MIN` (mínimo), `AVG` (promedio), `SUM` (suma). Intenta hacer las siguientes consultas:

**17.** Encuentra los hechizos promedio de los magos mayores a 25 años.

In [ ]:
%sql

**18.** Encuentra los magos cuya edad es menor que el promedio.

In [ ]:
%sql

**19.** Encuentra los cursos que no han sido tomados por el mago con menos hechizos.

In [ ]:
%sql

También podemos usar `COUNT` para contar tuplas. Hay dos versiones (pruébalas!):

- `SELECT COUNT(*) FROM Tabla` cuenta cuantas tuplas tiene la tabla.
- `SELECT COUNT(DISTINCT mnombre) FROM Magos` cuenta cuantos nombres distintos hay en Magos.

En general `SELECT COUNT(*) FROM Tabla` y `SELECT COUNT(atributo) FROM Tabla` es lo mismo, pero hay casos en los que es distinto: cuando las tablas tienen valores nulos o indefinidos. Hablaremos sobre esto más adelante en el curso.

Ahora realiza las siguientes consultas.

**20.** Encuentra cuantos magos menores de 40 años hay.

In [ ]:
%sql

**21.** Cuenta la cantidad de asignaturas cursadas en ...

In [ ]:
%sql

|**22.** Cuenta cuantos magos saben una cantidad de hechizos mayor al promedio y luego cuantos magos tienen saben una cantidad de hechizos menor al promedio.

In [ ]:
%sql

Finalmente podemos usar `GROUP BY` para ir agrupando los resultados. Prueba con la consulta:

In [ ]:
%%sql
SELECT mnombre, SUM(medad)
FROM Magos
GROUP BY mnombre

¿Qué pasó con Harry? Lo que hacemos es agrupar a las dos tuplas con nombre Harry en una, y sumamos la edad. Prueba ahora:

In [ ]:
%%sql
SELECT acreditos, count(acreditos)
FROM Asignaturas
GROUP BY acreditos

Ahora realiza las siguientes consultas:

**23.** Encuentra para los magos el promedio de los hechizos por cada edad distinta.

In [ ]:
%sql

**24.** Encuentra el número de cursos por cada cantidad de créditos de asignatura.

In [ ]:
%sql

**25.** Encuentra el numero de cursos por mago y por créditos de la asignatura.

In [ ]:
%sql

### Inserción y eliminación más compleja

Lo último que veremos es una forma de insertar y eliminar tuplas de forma más compleja. Por ejemplo podemos insertar valores de una consulta.

**26.** Crea una tabla `MagosTop(mid INT, mnombre VARCHAR(100))`

In [ ]:
%sql

Ahora ejecuta la siguiente inserción. Nota que para insertar desde una consulta no debemos escribir la instrucción `VALUES`.

In [ ]:
%%sql
INSERT INTO MagosTop
(SELECT mid,mnombre
FROM Magos
WHERE mhechizos > 8)